<template>
    <div class="about-container">
        <p>
            欢迎来到 "For Child"，这是一个特别为你开设的面向未来的学习平台。当你降临人间时，我决心为你创造了这个网站，旨在让你能够随时随地获取爸爸/妈妈对你的深情寄语和鼓励。
        </p>
        <p>
            "For Child"是一个灵感的源泉，一个引导你走向知识与智慧之路的指南。无论你是从事怎样的学习、工作和生活领域，这里都会成为你茁壮成长的伙伴。
        </p>
        <p>
            首先，我想告诉你，在你出生前，我们就用尽全力为你筹备了这里。每天都倾注了大量时间、心血和爱意，目的只有一个：那就是要给你最好的条件去探索自己的潜力，并以此实现你真正的梦想。
            "For Child"不仅提供了优秀文章、故事、经验分享和学习资源，还有由世界各地的人们贡献的智慧与创意。你可以在这里汲取知识、发掘兴趣爱好，挑战自己并成为真正的领袖。
            不论遇到怎样的困难和阻碍，在"For Child"中你都能找到坚持和毅力的力量。它会是你每个早晨醒来时第一道阳光，也会是你每个夜晚入梦时最温暖的拥抱。
            我相信，只要你心怀着对未来的信念和不断追求进步的精神，日后无论面临怎样的挑战，你都将勇往直前，永不放弃。
        </p>
        <p>
            "For Child"见证了我们之间深厚的情感纽带，展现了我的父母之爱、教育之意，以及我对你美好未来的期许。当我离开这个世界时，这个网站将继续陪伴你，并向你传递着生命的指引。
            无论何时，回到这里都可以找到属于你的源动力和灵感，提醒你记住家族的价值观和精神支持，继续向前。
            亲爱的孩子，这个网站是我给你的珍贵礼物，希望它能激励和引导你追求真理、付出心血，并成为一个独立、有影响力的人。
            无论何时，当你需要鼓励或者失落时，请记得"For Child"就在那里等待着你。
            愿你展翅高飞，成为改变世界的志士！永远爱你的……
        </p>

    </div>
</template>
<script lang="ts">
import { defineComponent } from 'vue';


export default defineComponent({
    name: 'About',
    setup() {
        return {
        }
    }
})
</script>

<style scoped>
.about-container>p {
    color: #878787;
    ;
}
</style>